<details><summary>Show Plan</summary>

```

terraform
module.o11y.grafana_data_source.cloudwatch: Refreshing state... [id=44]
data.assert_test.workspace: Reading...
data.assert_test.workspace: Read complete after 0s
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
aws_s3_bucket.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
module.ecs.aws_iam_policy.geoip_bucket_access: Refreshing state... [id=arn:aws:iam::898587786287:policy/staging_rpc-proxy_geoip_bucket_access]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging_rpc-proxy_logs]
aws_kms_key.analytics_bucket: Refreshing state... [id=8df8e26c-8045-4e01-b4a9-a35f64114cb4]
module.backup_dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/5ebe08a2-8357-4b47-be63-d48dd5e4e2d1]
module.logging.aws_s3_bucket.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.dns.data.aws_route53_zone.hosted_zone: Reading...
data.aws_ecr_repository.repository: Reading...
module.backup_dns.data.aws_route53_zone.hosted_zone: Reading...
module.redis.data.aws_vpc.vpc: Reading...
module.ecs.data.aws_vpc.vpc: Reading...
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-e8c738d4-a43b-41aa-83ac-ac6d8a3e5f65]
module.ecs.data.aws_ecr_image.service_image: Reading...
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 1s [id=Z09669243E0Q6ZCWCIW2U]
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/f3565b91-c093-4dfd-9916-76f16cc6cbe8]
module.backup_dns.data.aws_route53_zone.hosted_zone: Read complete after 1s [id=Z025697917GKV1T3MTR7I]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging_rpc-proxy_cluster]
aws_kms_alias.analytics_bucket: Refreshing state... [id=alias/analytics/rpc-proxy/staging]
data.aws_ecr_repository.repository: Read complete after 1s [id=rpc-proxy]
module.backup_dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z025697917GKV1T3MTR7I__4d22d935f4bfd18f85fd77a386484a45.staging.rpc.walletconnect.org._CNAME]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220819184526269000000002]
module.ecs.aws_iam_role_policy_attachment.geoip-bucket-policy-attach: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20221214151939690500000001]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220819184526273800000003]
module.ecs.data.aws_ecr_image.service_image: Read complete after 0s [id=sha256:6564aae011f4eddfebbebe398af50857a3cd6bf03cdeb2bcc098eb798548f570]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220908201556715000000001]
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U__4298f596ebd4d4df199cb24cba8db7f8.staging.rpc.walletconnect.com._CNAME]
module.ecs.data.aws_vpc.vpc: Read complete after 1s [id=vpc-09dce0b23af575478]
module.redis.data.aws_vpc.vpc: Read complete after 2s [id=vpc-09dce0b23af575478]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-rpc-proxy-ded/8d9823f8adeda723]
module.ecs.aws_security_group.vpc_app_ingress: Refreshing state... [id=sg-0fdb388e2b1c042d3]
module.redis.data.aws_subnets.private_subnets: Reading...
module.ecs.aws_security_group.tls_ingress: Refreshing state... [id=sg-0f3c213ea19bfc4d7]
module.ecs.data.aws_subnets.private_subnets: Reading...
module.ecs.data.aws_subnets.public_subnets: Reading...
module.redis.aws_security_group.service_security_group: Refreshing state... [id=sg-0dc8dc9dd50d9922f]
module.o11y.grafana_data_source.prometheus: Refreshing state... [id=45]
module.redis.data.aws_subnets.private_subnets: Read complete after 0s [id=eu-central-1]
module.redis.aws_elasticache_subnet_group.private_subnets: Refreshing state... [id=rpc-proxy-rpc-staging-private-subnet-group]
module.ecs.data.aws_subnets.private_subnets: Read complete after 0s [id=eu-central-1]
module.ecs.data.aws_subnets.public_subnets: Read complete after 0s [id=eu-central-1]
module.ecs.aws_alb.network_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/staging-rpc-proxy-lb-8bf/9db7ff60731600a6]
module.ecs.aws_iam_policy.analytics-data-lake_bucket_access: Refreshing state... [id=arn:aws:iam::898587786287:policy/staging_rpc-proxy_analytics-data-lake_bucket_access]
aws_s3_bucket_versioning.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
aws_s3_bucket_public_access_block.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
aws_s3_bucket_server_side_encryption_configuration.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
aws_s3_bucket_acl.analytics-data-lake_acl: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake,private]
module.logging.aws_s3_bucket_lifecycle_configuration.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.logging.aws_s3_bucket_versioning.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.logging.aws_s3_bucket_server_side_encryption_configuration.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.logging.aws_s3_bucket_acl.logging_bucket-acl: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs,log-delivery-write]
module.logging.aws_s3_bucket_public_access_block.logging_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.logging.data.aws_iam_policy_document.allow_logging_service: Reading...
module.logging.data.aws_iam_policy_document.allow_logging_service: Read complete after 0s [id=3646663536]
module.ecs.aws_iam_role_policy_attachment.analytics-data-lake-bucket-policy-attach: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20221214151940178400000002]
aws_s3_bucket_logging.analytics-data-lake_bucket: Refreshing state... [id=walletconnect.rpc-proxy.staging.analytics.data-lake]
module.logging.aws_s3_bucket_policy.allow_logging_service: Refreshing state... [id=walletconnect.rpc-proxy.staging.access-logs]
module.redis.aws_elasticache_cluster.cache: Refreshing state... [id=rpc-proxy-rpc-staging]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U_staging.rpc.walletconnect.com_A]
module.ecs.aws_route53_record.backup_dns_load_balancer: Refreshing state... [id=Z025697917GKV1T3MTR7I_staging.rpc.walletconnect.org_A]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/staging-rpc-proxy-lb-8bf/9db7ff60731600a6/62a7b956c11689e5]
module.ecs.aws_ecs_task_definition.app_task: Refreshing state... [id=staging_rpc-proxy]
module.o11y.grafana_dashboard.at_a_glance: Refreshing state... [id=staging_rpc-proxy]
module.ecs.aws_lb_listener_certificate.backup_cert: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/staging-rpc-proxy-lb-8bf/9db7ff60731600a6/62a7b956c11689e5_arn:aws:acm:eu-central-1:898587786287:certificate/5ebe08a2-8357-4b47-be63-d48dd5e4e2d1]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service"
        name                               = "staging_rpc-proxy-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy:67" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task must be replaced
-/+ resource "aws_ecs_task_definition" "app_task" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy:59" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging_rpc-proxy" -> (known after apply)
      ~ revision                 = 59 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on provider.tf line 5, in provider "aws":
   5:   skip_get_ec2_platforms      = true

With the retirement of EC2-Classic the skip_get_ec2_platforms attribute has
been deprecated and will be removed in a future version.

(and one more similar warning elsewhere)

Warning: Attribute Deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on provider.tf line 5, in provider "aws":
   5:   skip_get_ec2_platforms      = true

With the retirement of EC2-Classic the skip_get_ec2_platforms attribute has
been deprecated and will be removed in a future version.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```

</details>

*Action: `pull_request`*